---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsWarning
source: html/92295dca-9fee-cf90-e41f-3c5d1bdb8ba0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToIntersectParallelSegmentsWarning Property

The solution is failing to do segments which are parallel and should intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailToIntersectParallelSegmentsWarning { get; }
```